import React from 'react';
import {
    HandPlatter, WandSparkles, PartyPopper, Rocket,
    UtensilsCrossed, Video, CarFront
} from "lucide-react";

export const categories = [
    { name: "Սպասարկում", icon: <HandPlatter size={28} /> },
    { name: "Շոու", icon: <WandSparkles size={28} /> },
    { name: "Միջոցառումներ", icon: <PartyPopper size={28} /> },
    { name: "Տեխնիկա", icon: <Rocket size={28} /> },
    { name: "Օրավարձով գույք", icon: <UtensilsCrossed size={28} /> },
    { name: "Նկարահանում", icon: <Video size={28} /> },
    { name: "Ուղևորափոխադրում", icon: <CarFront size={28} /> },
];

export const servicesData = {
    "Սպասարկում": [
        {
            id: 1,
            title: "Մատուցող",
            description: "Յուրաքանյչուր մատուցող կարող է սպասարկել 15-20 անձի։ Ծառայության արժեքը կախված է միջոցառման անցկացման վայրից։",
            image: "/image/service/1724331775249--0.webp",
            price: 20000,
        },
        {
            id: 2,
            title: "Բարմեն",
            description: "Մեր պրոֆեսիոնալ բարմենները տիրապետում են տարբեր տեսակի խմիչքների պատրաստման հմտություններին։",
            image: "/image/service/1724330468263--0.webp",
            price: 25000,
        },
        {
            id: 3,
            title: "Խոհարար",
            description: "Արժեքը կախված է միջոցառման անձանց քանակից և ուտեստների մենյուից։",
            image: "/image/service/1724331582281--0.webp",
            price: 35000,
        },
        {
            id: 4,
            title: "Հանդիսավար",
            description: "Իսկական հանդիսավարը կարող է իր վարպետությամբ ստեղծել հիասքանչ և տոնական մթնոլորտ։",
            image: "/image/service/1724346434036--0.webp",
            price: 60000,
        },
        {
            id: 5,
            title: "Փրփուր Փարթի",
            description: "Նյութերը սերտիֆիկացված են, աչքերը չեն մռմռացնում, անվնաս են բույսերի և լողավազանի համար:",
            image: "/image/service/1725721755318--0.webp",
            price: 26900,
        }
    ],
    "Շոու": [
        {
            id: 6,
            title: "Դի-Ջեյ",
            description: "Ստեղծում են յուրաքանյչուր ճաշակին համապատասխան երաժշտական մթնոլորտ:",
            image: "/image/service/DJ.webp",
            price: 50000,
        }, {
            id: 7,
            title: "Երգիչ",
            description: `Amaranoc.am ի երգիչները, իրենց զարմանալի ձայնով և տաղանդով, կստեղծեն 
        յուրահատուկ մթնոլորտ։ Ընկղմվեք հնչյունների և ռիթմերի աշխարհում՝ վայելելով երաժշտության աննկարագրելի հաճույքը։`,
            image: "/image/service/Artist.webp",
            price: 150000,
        }, {
            id: 8,
            title: "Կրակներով շոու",
            description: `Կրակներով շոուն կստեղծի վառ և հիասքանչ ժամանց, որոնք կտպավորվեն մշտեպես Ձեր հիշողության մեջ։ 
        Մեր պրոֆեսիոնալ արտիստները տիրապետելով կրակի հետ խաղալու արվեստին, ստեղծում են ապշեցուցիչ գեղեցկությամբ և 
        ադրենալինով լի ներկայացումներ: Այստեղ դուք կընկղմվեք մի աշխարհ,որտեղ դուք ամբողջովին կզգաք կրակի իրական գեղեցկությունը և ջերմությունը։`,
            image: "/image/service/Show_with_fire.webp",
            price: 50000,
        }, {
            id: 9,
            title: "Ջութակահար",
            description: `Մեր տաղանդավոր երաժիշտները կստեղծեն անկրկնելի մթնոլորտ, որը կլցնի Ձեր միջոցառումը երաժշտության 
        հրաշքներով՝ դասական հնչյուններից մինչև ժամանակակից հիթեր։ Մեղեդիների ուղեկցությամբ Դուք կտեղափոխվեք մի աշխարհ՝ լցված նրբագեղությամբ և ոգեշնչմամբ։`,
            image: "/image/service/Violinist.webp",
            price: 80000,
        }, {
            id: 10,
            title: "Խաղավար",
            description: "Մեր խաղավարները միշտ կգտնեն Ձեր հյուրերին ուրախացնելու և Ձեր միջոցառումը մրցույթներով զարդարելու միջոց:",
            image: "/image/service/Gameplay.webp",
            price: 15000,
        }, {
            id: 11,
            title: "Մուլտհերոսներ",
            description: `Մեր մուլտհերոսները կախարդական կերպարներ են, ովքեր ժպիտ ու ուրախություն կպարգևեն ոչ միայն երեխաներին, 
        այլև մեծերին: Իրենց գունեղ անհատականություններով նրանք ձեզ կտանեն ֆանտաստիկայի և արկածների հիանալի աշխարհ՝ բարի և 
        խիզախ սուպերհերոսներից մինչև սրամիտ և զվարճալի կենդանիներ։ Ձեր միջոցառմանը հրավիրեք Մեր սիրելի մուլտհերոսներին, և 
        նրանք կպարգևեն Ձեր հյուրերին ուրախության և կախարդական նմոռանալի պահեր:`,
            image: "/image/service/MultHeroes.webp",
            price: 5000,
        }, {
            id: 12,
            title: "Աճպարհար",
            description: `Աճպարարի յուրաքանչյուր ներկայացում՝ լինի դա խենթ շողալու մոգություն, բարդ թարմություն կամ ճկուն տեխնիկա, 
        միշտ առանձնանում է բացառիկությամբ: Նա ստեղծում է մթնոլորտ, որտեղ իրականությունը ու երևակայությունը միաձուլվում են, իսկ 
        հանդիսատեսը հայտնվում է մի աշխարհում, որտեղ ամեն ինչ հնարավոր է: Հրավիրելով Մեր աճպարարին Դուք հնարավորություն կունենաք 
        ականատես լինելու անհավատալի տեսարանների, որոնք կզարմացնեն ոչ միայն փոքրերին այլ նաև մեծերին։`,
            image: "/image/service/MagicMan.webp",
            price: 60000,
        },
    ],
    "Միջոցառումներ": [{
        id: 13,
        title: "Նշանադրության կազմակերպում",
        description: `Նշանադրության արարողությունը առանձնահատուկ պահ է զույգի կյանքում: Մեր ընկերությունը կազմակերպում է նշանադրության 
      արարողություն, որը ստեղծում է կախարդական պահեր սիրահարների համար: Մեր նպատակն է անմոռանալի դարձնել այդ հիասքանչ միջոցառումը։ 
      Մենք ցուցաբերում ենք անհատական մոտեցում յուրաքանչյուր զույգին՝ օգնելով նրանց ստեղծել կատարյալ իրադարձություն։ Մեր փորձառու և 
      ստեղծագործ թիմը կապահովի արարողության գեղեցիկ դիզայնը ,սպասարկումը, երաժշտությունը,լուսային էֆֆեկտները և բոլոր մանրուքները, 
      ինչը կօգնի լիարժեք վայելելու Ձեր օրը։`,
        image: "/image/event/Event_1.webp",
        price: 500000,
    }, {
        id: 14,
        title: "Ծննդյան առիթների կազմակերպում",
        description: `«Amaranoc.am»-ը ձեր վստահելի գործընկերն է ծննդյան տոների կազմակերպման գործում: Մենք մասնագիտացած ենք ստեղծելու 
      անմոռանալի միջոցառումներ, որոնք ընդգծում են հոբելյարի յուրահատկությունն ու անհատականությունը: Մեր կրեատիվ մասնագետների թիմը 
      հոգ կտանի ամեն ինչի մասին՝ սկսած կոնցեպտից և դեկորից, մինչև զվարճանք և խոհարարական հյուրասիրություն: Վստահե՛ք մեզ ձեր ծննդյան 
      օրը կազմակերպելու գործը, և այն իսկապես անմոռանալի կլինի:`,
        image: "/image/event/Event_2.webp",
        price: 150000,
    }, {
        id: 15,
        title: "Հարսանյաց սենյակի ձևավորում",
        description: `Հարսանյաց սենյակի ձևավորման գործում Ձեզ կօգնի Մեր դիզայներների և ոճաբանների թիմը՝ ովքեր հաշվի առնելով Ձեր նախասիրությունները 
      և անհատականությունը, կհաղորդեն սենյակին նրբաճաշակություն, շքեղություն: Նուրբ գործվածքներից և մոմերից մինչև նրբաճաշակ ծաղիկներ և զարդեր։ 
      ️️Վստահեք Ձեր կյանքի ամենակարևոր առիթներից մեկը Մեր թիմին, ունենալով շքեղ և չկրկնվող ձևավորումներ։`,
        image: "/image/event/Event_3.webp",
        price: 80000,
    }, {
        id: 16,
        title: "Ֆոտոզոնաների ձևավորում",
        description: `«Amaranoc.am» Ձեր ուղեցույցն է եզակի և հիշվող ֆոտոզոնաների ստեղծման ոլորտում: Մենք մասնագիտացած ենք լուսանկարչական գոտիների ստեղծման 
      գործում, որոնք կատարյալ լրացում են Ձեր միջոցառման համար: Կախված Ձեր միջոցառման թեմայից, Մենք կստեղծենք լուսանկարչական գոտի, որը կարտացոլի ձեր ոճը և 
      կտա հնարավություն ունենալու գեղեցիկ և յուրահատկուկ նկարներ:`,
        image: "/image/event/Event_4.webp",
        price: 40000,
    }, {
        id: 17,
        title: "Գենդեր փարթի",
        description: `Գիտակցելով միջոցառման կարևորությունը Մեր կրեատիվ թիմը պատրաստ է ամբողջության կազմակերպելու այս գեղեցիկ օրը, դարձնելով այն անմոռանալի։ 
      Մենք կօգնենք Ձեզ պլանավորելու, զարդարելու, խաղերի և ժամանցի հարցում, որպեսզի Ձեր միջոցառումը լինի գեղեցիկ և ուրախ իրադարձություն, որը կհիշվի ամբողջ կյանքում:`,
        image: "/image/event/Event_5.webp",
        price: 180000,
    }],
    "Տեխնիկա": [{
        id: 18,
        title: "Ծանր ծուխ",
        description: `Լավագույն ծանր ծուխը, որը ձեր միջոցառումն կդարձնի էլ ավելի գողեցիկ և հիշարժան։ Մեր սարքավորումները կարողանում են բարձրորակ ծուխը տարածել 
      մաքսիմալ մեծ մակերեսով և բարձր խտությամբ։ Ծուխն էկոլոգիապես մաքուր է և իր մեջ ներառում է միայն տաք ջուր։`,
        image: "/image/tech/Tech_1.webp",
        price: 30000,
    }, {
        id: 19,
        title: "Հրավառության ծառայություն",
        description: `Հրավառության ծառայությունը առաջարկում է փայլուն և անպայման հիշարժան հրավառություն՝ յուրաքանչյուր իրադարձության համար հատուկ ձևով։ 
      Մեր թիմը կազմակերպում է բոլոր անհրաժեշտ գործընթացները՝ նախապատրաստական աշխատանքից մինչև իրականացման փուլը։ Արժեքները փոփոխվում են կախված միջոցառման 
      ծավալից, հրավառության տեսակից և այլ հանգամանքներից։`,
        image: "/image/tech/Tech_2.webp",
        price: 30000,
    }, {
        id: 20,
        title: "Սառը հրավառություն",
        description: `Սառը հրավառության ծառայությունը առաջարկում է հիանալի, անվտանգ և արտասովոր միջոցառման լուծում՝ կրակ և ծուխ բացակայությամբ: Այս 
      ծառայությունը օգտագործում է հատուկ պիրոտեխնիկական սարքավորումներ, որոնք ստեղծում են գեղեցիկ տեսողական էֆեկտներ՝ օգտագործելով սառը լույսեր, էֆեկտային 
      աղմուկներ և խորը լույսեր, որոնք ի վիճակի են փոխարինել ավանդական հրավառություններին առանց կրակի վտանգի: Արժեքները փոփոխվում են կախված միջոցառման 
      ծավալից, հրավառության տեսակից և այլ հանգամանքներից։`,
        image: "/image/tech/Tech_3.webp",
        price: 30000,
    }, {
        id: 21,
        title: "Պրոյեկտոր",
        description: `Ձեր միջոցառումները դարձնելու համար ավելի հարմարավետ ու արդյունավետ, մենք տրամադրում ենք պրոյեկտորներ տարբեր որակի և չափսերի։ 
      Իրականացնում ենք նաև տեղադրում։ Արժեքը կախված պրոյեկտորի տեսակից կարող է փոփոխվել։`,
        image: "/image/tech/Tech_4.webp",
        price: 15000,
    }, {
        id: 22,
        title: "Նվագարկիչ",
        description: `Ձեր միջոցառման երաժշտական առավելության հասնելու համար առաջարկում ենք բարձր որակի նվագարկիչների օրավարձով վարձակալության ծառայություն: 
      Արժեքը կարող է փոփոխվել կախված նվագարկիչների չափսերից և որակից։`,
        image: "/image/tech/Tech_5.webp",
        price: 10000,
    }],
    "Օրավարձով գույք": [{
        id: 23,
        title: "Սպասք",
        description: `Ձեր միջոցառումները դարձնելու համար ավելի հարմարավետ և ոճային, առաջարկում ենք օրավարձով սպասքի ծառայություններ։ Տրամադրվում է տարբեր ձևի 
      և միանման ամաններ, գդալներ, պատառաքաղներ և այն ամենը ինչ անհրաժեշտ է ուտեստների գեղեցիկ մատուցման համար։`,
        image: "/image/daily_rentals/Daily_rentals_1.webp",
        price: 100,
    }, {
        id: 24,
        title: "Սեղան և աթոռներ",
        description: `Մեր օրավարձով կահույքի ծառայությունը հնարավորություն է տալիս վարձակալել բարձր որակի սեղաններ և աթոռներ՝ համաձայն ձեր կարիքների:`,
        image: "/image/daily_rentals/Daily_rentals_2.webp",
        price: 5000,
    }, {
        id: 25,
        title: "Տենտ",
        description: `Մեր տենտերը համադրվում են ցանկացած միջոցառմանը և հիանալի լուծում են պաշտպանվելու համար ցանկացած եղանակից։ Այն կդարձնի ձեր միջոցառման 
      անցկացման վայրը ավելի գեղեցիկ և ոճային։ Արժեքները կարող են փոփոխվել կախված չափսերից և քանակից։`,
        image: "/image/daily_rentals/Daily_rentals_3.webp",
        price: 20000,
    }],
    "Նկարահանում": [{
        id: 26,
        title: "Ֆոտո նկարահանում",
        description: `Մենք ուրախ ենք առաջարկել պրոֆեսիոնալ ֆոտո նկարահանման ծառայություն։ Մեր նպատակն է, որ ձեր միջոցառումը կամ պրոեկտը անցնի համարձակ և 
      ստեղծագործական միջավայրում՝ առանց որևէ տեխնիկական անհանգստությունների: Արժեքները կարող են փոփոխվել կախված քանակից և միջոցառման անցկացման վայրից։`,
        image: "/image/filming/Filming_1.webp",
        price: 20000,
    }, {
        id: 27,
        title: "Վիդեո նկարահանում",
        description: `Ձեր տեսանյութերը կստանան բարձր որակ և պրոֆեսիոնալ շունչ մեր վիդեո նկարահանման ծառայության միջոցով: Բարձրացրեք ձեր տեսանյութերի որակը՝ 
      առանց մեծ ներդրումների: Արժեքը կարող է փոփոխվել կախված միջոցառման չափսից և անցկացման վայրից։`,
        image: "/image/filming/Filming_2.webp",
        price: 35000,
    }, {
        id: 28,
        title: "Դրոնով նկարահանում",
        description: `Ապահովեք ձեր նախագծերին անկրկնելի տեսողական որակ մեր պրոֆեսիոնալ դրոններով: Մենք առաջարկում ենք նորագույն տեխնոլոգիաներով զինված դրոններով 
      նկարահանում, որն ապահովում է աննախադեպ բարձր որակի օդային նկարահանումներ տարբեր առիթների համար:`,
        image: "/image/filming/Filming_3.webp",
        price: 25000,
    }],
    "Ուղևորափոխադրում": [{
        id: 29,
        title: "Ուղևորափոխադրում",
        description: `Մենք տրամադրում ենք բարձրակարգ փոխադրամիջոցներ՝ ապահովելով Ձեր ճանապարհորդության հարմարավետությունն ու անվտանգությունը: Մեքենաները գտնվում 
      են մաքուր և սարքին վիճակում։ Արժեքները կարող են փոփոխվել կախված ուղևորության տեսակից։`,
        image: "/image/passenger_transportation/Passenger_transportation.webp",
        price: 20000,
    }],
};